esoeproject/esoeproject/saml2cpp/include/saml2/handlers/impl/UnmarshallerImpl.h
	/*
	 * Unmarshalls an instance of a SAML metadata document and verifies all cryptography, on success returns the
	 * associated XSD generated object representation for further processing. Additionally all keys are extracted from
	 * metadata and stored in a map with a key of the name of the crpto key and object of type XSECCryptoKey
	 * 
	 * @param doc Byte representation of the document to process
	 * @param size Number of bytes present in the doc buffer that should be processed
	 * @param pk The public key to be used for cryptography validation operations
	 * @param keepDOM Indicates if the dom structure should be retained for use by the caller, default false
	 * 
	 * @exception UnmarshallerException, wrapped exception detailing error state
	 * @exception InvalidParameterException, when invalid data is fed to the library
	 */
	template <class T>
	saml2::MetadataOutput<T>*  UnmarshallerImpl<T>::unMarshallMetadata (const SAMLDocument& document, XSECCryptoKey* pk, bool keepDOM)
	{
		DOMDocument* domDoc = NULL;
		DOMNodeList* keyDescriptorList = NULL;	
		T* xmlObj = NULL;
		
		if(document.getData() == NULL || document.getLength() == 0)
			SAML2LIB_INVPARAM_EX("Supplied xml document was NULL");

		if(pk == NULL)
			SAML2LIB_INVPARAM_EX("Supplied public key was NULL");
			
		saml2::MetadataOutput<T>* output = new MetadataOutput<T>();
		bool validKeyData = false;
		try
		{
			domDoc = validate(document);
			validateSignature(domDoc, pk);
			
			/* Once metadata is validated extract all public keys for usage by caller, most likely in a key resolver impl */		
			keyDescriptorList = domDoc->getElementsByTagNameNS(this->metadataURI, this->keyDescriptor);
			
			for(XMLSize_t i = 0; i < keyDescriptorList->getLength(); i++)
			{
				DOMNodeList* keyInfoList;
				DOMElement* descriptor;
		
				/* We have a valid document to schema by this stage so this will only be a single node */
				descriptor = (DOMElement*)keyDescriptorList->item(i);
				keyInfoList = descriptor->getElementsByTagNameNS(this->dsigURI, this->keyInfo);
				for(XMLSize_t j = 0; j < keyInfoList->getLength(); j++)
				{
					DOMElement* info = NULL;
					DOMElement* keyValue = NULL;
					DOMNodeList* keyNameList = NULL;
					DOMNodeList* keyValueList = NULL;
					DOMNodeList* RSAKeyDataList = NULL;
					DOMNodeList* DSAKeyDataList = NULL;
					char* keyName = NULL;
					
					/* Successfully extracted a KeyInfo element to process, currently only interested in the name, type and actual key data,
					 * this may be extended in the future, particuarly with differentiation around usage for signing or encryption etc
					 */
					info = (DOMElement*)keyInfoList->item(j);
					keyNameList = info->getElementsByTagNameNS(this->dsigURI, this->keyName);
					if ( keyNameList->getLength() == 0)
						SAML2LIB_UNMAR_EX( "While parsing key info no KeyName element present, key can't be referenced" );
					
					keyValueList = info->getElementsByTagNameNS(this->dsigURI, this->keyValue);
					if ( keyValueList->getLength() == 0)
						SAML2LIB_UNMAR_EX( "While parsing key info no KeyValue element present, key data can't be used" );
						
					/* Provide support for either RSA or DSA at the current point in time - Data must live at 0 due to validity of document and schema
					 * structure defined
					 */
					keyValue = (DOMElement*)keyValueList->item(0);			
					
					RSAKeyDataList = keyValue->getElementsByTagNameNS(this->dsigURI, this->rsaKeyValue);
					DSAKeyDataList = keyValue->getElementsByTagNameNS(this->dsigURI, this->dsaKeyValue);
							
					if( RSAKeyDataList->getLength() == 1 )
					{
						DOMElement* RSAKeyData = NULL;
						DOMElement* RSAKeyDataModulus = NULL;
						DOMElement* RSAKeyDataExponent = NULL;
						char* modulus = NULL;
						char* exponent = NULL;
						saml2::KeyData keyData;
		
						validKeyData = true;
						RSAKeyData = (DOMElement*)RSAKeyDataList->item(0);
						
						RSAKeyDataModulus = (DOMElement*)RSAKeyData->getChildNodes()->item(0);
						RSAKeyDataExponent = (DOMElement*)RSAKeyData->getChildNodes()->item(1);
						
						modulus = XMLString::transcode( RSAKeyDataModulus->getFirstChild()->getNodeValue());
						exponent = XMLString::transcode( RSAKeyDataExponent->getFirstChild()->getNodeValue());
						keyName = XMLString::transcode( keyNameList->item(0)->getFirstChild()->getNodeValue());

						/* Populate the KeyData object */
						keyData.type = saml2::KeyData::RSA;
						keyData.modulus = std::string( modulus, XMLString::stringLen(RSAKeyDataModulus->getFirstChild()->getNodeValue()) );
						keyData.exponent = std::string( exponent, XMLString::stringLen(RSAKeyDataExponent->getFirstChild()->getNodeValue()) );
						keyData.keyName = std::string( keyName, XMLString::stringLen(keyNameList->item(0)->getFirstChild()->getNodeValue()) );
						
						/* insert the created crypto key into the response map with its map key being the key name */
						output->keyList.insert(std::make_pair( keyName, keyData ));
						
						delete [] keyName;
						XMLString::release(&modulus);
						XMLString::release(&exponent);
					}
					
					if( DSAKeyDataList->getLength() == 1 )
					{
						DOMElement* DSAKeyData = NULL;
						DOMNodeList* Pn = NULL;
						DOMNodeList* Qn = NULL;
						DOMNodeList* Gn = NULL;
						DOMNodeList* Yn = NULL;
						DOMNodeList* Jn = NULL;
						char* P = NULL;
						char* Q = NULL;
						char* G = NULL;
						char* Y = NULL;
						char* J = NULL;
						saml2::KeyData keyData;
						
						validKeyData = true;
						DSAKeyData = (DOMElement*)DSAKeyDataList->item(0);
						
						Pn = DSAKeyData->getElementsByTagNameNS(this->dsigURI, this->dsaP);
						Qn = DSAKeyData->getElementsByTagNameNS(this->dsigURI, this->dsaQ);
						Gn = DSAKeyData->getElementsByTagNameNS(this->dsigURI, this->dsaG);
						Yn = DSAKeyData->getElementsByTagNameNS(this->dsigURI, this->dsaY);
						Jn = DSAKeyData->getElementsByTagNameNS(this->dsigURI, this->dsaJ);
						
						if(Pn->getLength() == 1)
						{
							P = XMLString::transcode( Pn->item(0)->getFirstChild()->getNodeValue());
							keyData.p = std::string( P, XMLString::stringLen(Pn->item(0)->getFirstChild()->getNodeValue()) );
						}
						if(Qn->getLength() == 1)
						{	 
							Q = XMLString::transcode( Qn->item(0)->getFirstChild()->getNodeValue());
							keyData.q = std::string( Q, XMLString::stringLen(Qn->item(0)->getFirstChild()->getNodeValue()) );
						}
						if(Gn->getLength() == 1)
						{	
							G = XMLString::transcode( Gn->item(0)->getFirstChild()->getNodeValue());
							keyData.g = std::string( G, XMLString::stringLen(Gn->item(0)->getFirstChild()->getNodeValue()) );
						}
						if(Yn->getLength() == 1)
						{
							Y = XMLString::transcode( Yn->item(0)->getFirstChild()->getNodeValue());
							keyData.y = std::string( Y, XMLString::stringLen(Yn->item(0)->getFirstChild()->getNodeValue()) );
						}
						if(Jn->getLength() == 1)
						{
							J =  XMLString::transcode( Jn->item(0)->getFirstChild()->getNodeValue());
							keyData.j = std::string( J, XMLString::stringLen(Jn->item(0)->getFirstChild()->getNodeValue()) );
						} 
						
						keyName = XMLString::transcode( keyNameList->item(0)->getFirstChild()->getNodeValue());
						keyData.keyName = std::string( keyName );
						
						/* insert the created crypto key into the response map with its map key being the key name */
						output->keyList.insert(std::make_pair( keyName, keyData ));
						
						delete keyName;	
						XMLString::release(&P);
						XMLString::release(&Q);
						XMLString::release(&G);
						XMLString::release(&Y);
						XMLString::release(&J);					
					}
					
