esoeproject/esoeproject/saml2cpp/include/saml2/handlers/impl/UnmarshallerImpl.h
					if(!validKeyData)
						SAML2LIB_UNMAR_EX( "While parsing key info invalid Key Data type found, support for DSA and RSA keys only currently" );  
				}
			}			
			
			if(keepDOM)
			{
				/* Note that the memory referenced by domDoc becomes owned by our XSD object implementation
				 * in this case and will be cleaned up as required when this object is removed 
				 */
				xmlObj = new T ( *domDoc->getDocumentElement(), xsd::cxx::tree::flags::keep_dom | xsd::cxx::tree::flags::dont_validate | xsd::cxx::tree::flags::dont_initialize);
			}
			else
			{
				xmlObj = new T ( *domDoc->getDocumentElement(), xsd::cxx::tree::flags::dont_validate | xsd::cxx::tree::flags::dont_initialize);
				domDoc->release();
			}
			
			output->xmlObj = xmlObj;			
		}
		catch (xsd::cxx::tree::parsing< wchar_t > &exc)
		{
			SAML2LIB_UNMAR_EX_CAUSE( "XSD Parsing exception while unmarshalling metadata", exc.what() );
		}
		catch (xsd::cxx::tree::expected_element< wchar_t > &exc)
		{
			SAML2LIB_UNMAR_EX_CAUSE( "XSD expected elements exception while unmarshalling metadata", exc.what() );
		}
		catch (xsd::cxx::tree::unexpected_element< wchar_t > &exc)
		{
			SAML2LIB_UNMAR_EX_CAUSE( "XSD unexpected elements exception while unmarshalling metadata", exc.what() );
		}
		catch (xsd::cxx::tree::expected_attribute< wchar_t > &exc)
		{
			SAML2LIB_UNMAR_EX_CAUSE( "XSD expected attribute exception while unmarshalling metadata", exc.what() );
		}
		catch (xsd::cxx::tree::unexpected_enumerator< wchar_t > &exc)
		{
			SAML2LIB_UNMAR_EX_CAUSE( "XSD unexpected enumerator exception while unmarshalling metadata", exc.what() );
		}
		catch (xsd::cxx::tree::no_type_info< wchar_t > &exc)
		{
			SAML2LIB_UNMAR_EX_CAUSE( "XSD no type info exception while unmarshalling metadata", exc.what() );
		}
		catch (xsd::cxx::tree::not_derived< wchar_t > &exc)
		{
			SAML2LIB_UNMAR_EX_CAUSE( "XSD not derived exception while unmarshalling metadata", exc.what() );
		}
		catch (xsd::cxx::tree::exception< wchar_t > &exc)
		{
			SAML2LIB_UNMAR_EX_CAUSE( "XSD generic exception while unmarshalling metadata", exc.what() );
		}
		catch (std::bad_alloc &exc)
		{
			SAML2LIB_UNMAR_EX_CAUSE( "Bad memory alloc while unmarshalling metadata", exc.what() );
		}
		catch(SAXException &exc)
		{
			SAML2LIB_UNMAR_EX_CAUSE( "SAXException while unmarshalling metadata", exc.getMessage() );
		}
		catch(DOMException &exc)
		{
			SAML2LIB_UNMAR_EX_CAUSE( "DOMException while unmarshalling metadata", exc.getMessage() );
		}
		catch(XMLException &exc)
		{
			SAML2LIB_UNMAR_EX_CAUSE( "XMLException while unmarshalling metadata", exc.getMessage() );
		}
		catch(std::exception &exc)
		{
			SAML2LIB_UNMAR_EX_CAUSE( "Exception while unmarshalling metadata", exc.what() );
		}
		catch(...)
		{
			SAML2LIB_UNMAR_EX( "Generic exception while unmarshalling metadata" );
		}
		
		return output;
	}

	/*
	 * Utilises Xerces DOM level 3 DOMBuilder object to parse and validate the supplied DOMDocument
	 * instance, returns instance of DOMDocument generated by parsing
	 */
	template <class T>
	DOMDocument* UnmarshallerImpl<T>::validate (const SAMLDocument& document)
	{
		Wrapper4InputSource* wrapedSource = NULL;
		DOMBuilder* parser = NULL;
		DOMDocument* domDoc = NULL;
		MemBufInputSource* inputSource = NULL;
		XMLCh* schema = NULL;

		try
		{
			parser = this->domImpl->createDOMBuilder(DOMImplementationLS::MODE_SYNCHRONOUS, NULL);

			/* Setup all the required parser variables, NB dont trust 'defaults' */
			parser->setErrorHandler(this->errorHandler);
			parser->setEntityResolver(this->resourceResolver);

			parser->setFeature(XMLUni::fgXercesSchema, true);
			parser->setFeature(XMLUni::fgDOMValidation, true);
			parser->setFeature(XMLUni::fgDOMNamespaces, true);
			parser->setFeature(XMLUni::fgDOMWhitespaceInElementContent, false);
			parser->setFeature(XMLUni::fgDOMEntities, false);
			parser->setFeature(XMLUni::fgXercesUseCachedGrammarInParse, true);
			parser->setFeature(XMLUni::fgXercesUserAdoptsDOMDocument, true);

			/* This is particuarly important so that signatures are not corrupted*/
			parser->setFeature(XMLUni::fgDOMDatatypeNormalization, false);

			for(std::vector<std::string>::iterator i = this->
			        schemaList.begin();
			        i != this->schemaList.end();
			        i++)
			{
				schema = XMLString::transcode ( i->c_str() );
				parser->loadGrammar(schema, Grammar::SchemaGrammarType, true);
				XMLString::release(&schema);
			}

			inputSource = new MemBufInputSource ((const XMLByte*)document.getData(), document.getLength(), UNMARSHALLER_ID);
			wrapedSource = new Wrapper4InputSource(inputSource);
			domDoc = parser->parse(*wrapedSource);

			parser->release();
			parser = NULL;
			delete wrapedSource;
			wrapedSource = NULL;
		}
		catch(...)
		{
			/* Clean up any memory allocated and throw back up stack */
			if(schema != NULL)
				XMLString::release(&schema);

			if(parser != NULL)
			{
				parser->release();
				parser = NULL;
			}
			
			if(wrapedSource != NULL)
			{
				delete wrapedSource;
				wrapedSource = NULL;
			}
			throw;
		}
		
		return domDoc;
	}

	/*
	 * Performs all cryptography operations associated with validating cryptography in the supplied domDocument,
	 * utilises the apache XML Security C library
	 */
	template <class T>
	void UnmarshallerImpl<T>::validateSignature (DOMDocument* doc, XSECCryptoKey* pk)
	{
		XSECProvider prov;
		DSIGSignature* sig = NULL;
		DSIGReferenceList* refList = NULL;
		DOMNodeList* nodeList = NULL;
		XMLSize_t size;
		XMLSize_t refListSize;
		bool validSig;

		try
		{
			// TODO Leaking memory here?
			nodeList = doc->getElementsByTagNameNS(this->dsigURI, this->dsigSigElem);
			/* Valgrind reports:
			==9094== 67,150 (436 direct, 66,714 indirect) bytes in 1 blocks are definitely lost in loss record 1,313 of 1,355
			==9094==    at 0x4005BA5: operator new(unsigned) (vg_replace_malloc.c:163)
			==9094==    by 0x502D295: xercesc_2_7::MemoryManagerImpl::allocate(unsigned) (in /usr/local/site/dev/xerces-c-src_2_7_0/lib/libxerces-c.so.27.0)
			==9094==    by 0x4FC1EA1: xercesc_2_7::DOMDeepNodeListPool<xercesc_2_7::DOMDeepNodeListImpl>::initialize(unsigned long) (in /usr/local/site/dev/xerces-c-src_2_7_0/lib/libxerces-c.so.27.0)
			==9094==    by 0x4FC1F2A: xercesc_2_7::DOMDeepNodeListPool<xercesc_2_7::DOMDeepNodeListImpl>::DOMDeepNodeListPool(unsigned long, bool, unsigned long) (in /usr/local/site/dev/xerces-c-src_2_7_0/lib/libxerces-c.so.27.0)
			==9094==    by 0x4FBCE18: xercesc_2_7::DOMDocumentImpl::getDeepNodeList(xercesc_2_7::DOMNode const*, unsigned short const*, unsigned short const*) (in /usr/local/site/dev/xerces-c-src_2_7_0/lib/libxerces-c.so.27.0)
			==9094==    by 0x4FBCEE1: xercesc_2_7::DOMDocumentImpl::getElementsByTagNameNS(unsigned short const*, unsigned short const*) const (in /usr/local/site/dev/xerces-c-src_2_7_0/lib/libxerces-c.so.27.0)
			==9094==    by 0x49CEAE3: saml2::UnmarshallerImpl<middleware::ESOEProtocolSchema::ValidateInitializationResponseType>::validateSignature(xercesc_2_7::DOMDocument*, XSECCryptoKey*) (UnmarshallerImpl.h:984)
			==9094==    by 0x49C4B55: middleware::ESOEProtocolSchema::ValidateInitializationResponseType* spep::SOAPUtil::SOAP11Handler::unwrap<middleware::ESOEProtocolSchema::ValidateInitializationResponseType>(saml2::Unmarshaller<middleware::ESOEProtocolSchema::ValidateInitializationResponseType>*, saml2::ManagedDocument<unsigned char, long, unsigned> const&) (SOAPUtil.h:250)
			==9094==    by 0x49C4E64: middleware::ESOEProtocolSchema::ValidateInitializationResponseType* spep::SOAPUtil::unwrapObjectFromSOAP<middleware::ESOEProtocolSchema::ValidateInitializationResponseType>(saml2::Unmarshaller<middleware::ESOEProtocolSchema::ValidateInitializationResponseType>*, saml2::ManagedDocument<unsigned char, long, unsigned> const&, spep::SOAPUtil::SOAPVersion) (SOAPUtil.h:140)
			==9094==    by 0x49C5391: middleware::ESOEProtocolSchema::ValidateInitializationResponseType* spep::WSClient::doWSCall<middleware::ESOEProtocolSchema::ValidateInitializationResponseType>(std::string, xercesc_2_7::DOMDocument*, saml2::Unmarshaller<middleware::ESOEProtocolSchema::ValidateInitializationResponseType>*, spep::SOAPUtil::SOAPVersion) (WSClient.h:106)
			==9094==    by 0x49C176E: spep::StartupProcessorImpl::doStartup() (StartupProcessorImpl.cpp:228)
			==9094==    by 0x49C2460: spep::StartupProcessorImpl::StartupProcessorThread::operator()() (StartupProcessorImpl.cpp:305)
			*/
			size = nodeList->getLength();

			if(size == 0)
				SAML2LIB_UNMAR_EX( "Document contained no signature elements to validate on" );
				
			for(XMLSize_t i = 0; i < size; i++)
			{
				validSig = false;
				sig = prov.newSignatureFromDOM(doc, nodeList->item(i));
				sig->load();
				
				/* Use either the supplied pk or if null the registered instance of external key resolver */
				if( pk != NULL )
					sig->setSigningKey(pk->clone());
				else
					sig->setKeyInfoResolver(this->extKeyResolver);

				validSig = sig->verify();

				if(!validSig)
				{
					if (!sig->verifySignatureOnly())
					{
						SAML2LIB_UNMAR_EX( "Signature validation failed with invalid signature for supplied public key" );
					}
					else
					{
						refList = sig->getReferenceList();
						refListSize = nodeList->getLength();

						for(XMLSize_t j = 0; j < refListSize; i++)
						{
							if( !refList->item(j)->checkHash() )
							{
								SAML2LIB_UNMAR_EX( "Signature validation failed with invalid supplied reference, the request document has been tampered with or the parent element to this signature block has no ID attribute");
							}
						}
					}
				}
				
				prov.releaseSignature(sig);
				sig = NULL;
			}
		}
		catch (XSECCryptoException &e)
		{
			if(sig != NULL)
				prov.releaseSignature(sig);

			SAML2LIB_UNMAR_EX_CAUSE( "An exception occurred during an encryption operation", e.getMsg() );
		}
		catch (XSECException &e)
		{
			if(sig != NULL)
				prov.releaseSignature(sig);

			SAML2LIB_UNMAR_EX_CAUSE( "An exception occurred during a security operation", e.getMsg() );
		}
		catch(...)
		{
			if(sig != NULL)
				prov.releaseSignature(sig);

			throw;
		}
	}
}

#endif /*UNMARSHALLERIMPL_H_*/
